src/Documents/ИсходящееПисьмо/ИсходящееПисьмо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИсходящееПисьмо</name>
  <basedOn>Catalog.ВнутренниеДокументы</basedOn>
  <basedOn>Catalog.ВходящиеДокументы</basedOn>
  <basedOn>Catalog.ИсходящиеДокументы</basedOn>
  <basedOn>Catalog.ПроектныеЗадачи</basedOn>
  <basedOn>Catalog.Проекты</basedOn>
  <basedOn>Task.ЗадачаИсполнителя</basedOn>
  <basedOn>Catalog.Мероприятия</basedOn>
  <basedOn>Catalog.Файлы</basedOn>
  <basedOn>Catalog.УведомленияПрограммы</basedOn>
  <basedOn>Document.Отсутствие</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВажностьПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМаршрутизации</name>
    <type>
      <types>EnumRef.ВидыМаршрутизацииПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кодировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСпособаАдресации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительКонтакт</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ЛичныеАдресаты</types>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправкаОтменена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Папка</name>
    <type>
      <types>CatalogRef.ПапкиПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>ПисьмоОснование</name>
    <type>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодготовленоКОтправке</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучателиПисьмаСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>CatalogRef.УведомленияПрограммы</types>
      <types>CatalogRef.Проекты</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.СообщенияОбсуждений</types>
      <types>CatalogRef.КонтрольныеТочки</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.Мероприятия</types>
      <types>CatalogRef.ПроектныеЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВидаМаршрутизации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПисьмаHTMLХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОтвета</name>
    <type>
      <types>EnumRef.ТипыОтвета</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТекста</name>
    <type>
      <types>EnumRef.ТипыТекстовПочтовыхСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОДоставке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОПрочтении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолучателиКопий</name>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиОтвета</name>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиПисьма</name>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиСкрытыхКопий</name>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьАдрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьКонтакт</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.ЛичныеАдресаты</types>
        <types>CatalogRef.РолиИсполнителей</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьОтображаемоеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/expert1cУчастникиПортала/expert1cУчастникиПортала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>expert1cУчастникиПортала</name>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеОрганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адресат</name>
    <type>
      <types>CatalogRef.АдресатыПочтовыхСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>Подтвержден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Соль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешПароля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТокенПодтвержденияХеш</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодтверждениеДействуетДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>DateTime</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодтверждениеВыслано</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>DateTime</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТокенСессииХеш</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТокенСессииДействуетДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>DateTime</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПопыткиВхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БлокировкаДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>DateTime</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/СтатусЗадачНаВыполнение/СтатусЗадачНаВыполнение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатусЗадачНаВыполнение</name>
  <predefined>
    <items>
      <name>Выполнена</name>
      <description>Выполнена</description>
    </items>
    <items>
      <name>ПолученОтвет</name>
      <description>Получен ответ</description>
    </items>
    <items>
      <name>Принята</name>
      <description>Принята</description>
    </items>
  </predefined>
</mdclass:Catalog>

src/CommonModules/expert1cПорталЗаявок/Module.bsl
// expert1c 03.10.2026 Портал заявок для внешних пользователей
// Регистрация по почте, вход, создание и просмотр своих заявок.
// Вызывается из HTTP-сервиса expert1cПорталЗаявок. Данные читаются и пишутся в привилегированном режиме,
// поэтому каждая функция сама проверяет, что заявка принадлежит участнику портала.
// Пароль задается только после подтверждения почты по ссылке из письма (так же работает восстановление пароля).

#Область ПрограммныйИнтерфейс

// Начинает регистрацию (или восстановление пароля): отправляет на почту ссылку для установки пароля.
// Ответ одинаковый для новых и уже зарегистрированных адресов, чтобы нельзя было перебирать адреса.
//
// Параметры:
//  Email - Строка - почта, она же логин
//  Имя - Строка - имя участника
//  НазваниеОрганизации - Строка - название организации пользователя (обязательно); по нему подбирается контрагент
//
// Возвращаемое значение:
//  Структура - Код (Число), Данные (Структура: message)
//
Функция Зарегистрировать(Знач Email, Знач Имя, Знач НазваниеОрганизации) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Email = НормализоватьEmail(Email);
	Имя = Лев(СокрЛП(Имя), 100);

	Если НЕ EmailКорректен(Email) Тогда
		Возврат Ошибка(400, "Укажите корректный адрес электронной почты.");
	КонецЕсли;
	Если ПустаяСтрока(Имя) Тогда
		Возврат Ошибка(400, "Укажите имя.");
	КонецЕсли;
	НазваниеОрганизации = Лев(СокрЛП(НазваниеОрганизации), 150);
	Если СтрДлина(НормализованноеНазвание(НазваниеОрганизации)) < 2 Тогда
		Возврат Ошибка(400, "Укажите название организации.");
	КонецЕсли;

	Участник = Справочники.expert1cУчастникиПортала.НайтиПоРеквизиту("Email", Email);
	Если Участник.Пустая() Тогда
		Объект = Справочники.expert1cУчастникиПортала.СоздатьЭлемент();
		Объект.Email = Email;
		Объект.Наименование = Имя;
		Объект.НазваниеОрганизации = НазваниеОрганизации;
		Объект.Контрагент = ПодобратьКонтрагента(НазваниеОрганизации).Контрагент;
		Объект.Адресат = ВстроеннаяПочтаСервер.ПолучитьПочтовогоАдресата(Email, Имя);
	Иначе
		Объект = Участник.ПолучитьОбъект();
		Если НЕ Объект.Подтвержден Тогда
			Объект.Наименование = Имя;
			Объект.НазваниеОрганизации = НазваниеОрганизации;
			Объект.Контрагент = ПодобратьКонтрагента(НазваниеОрганизации).Контрагент;
		КонецЕсли;
	КонецЕсли;

	ТекДата = ТекущаяДатаСеанса();

	// Не чаще одного письма в 5 минут на адрес.
	Если ЗначениеЗаполнено(Объект.ПодтверждениеВыслано) И ТекДата < Объект.ПодтверждениеВыслано + 300 Тогда
		Возврат Ответ(200, Новый Структура("message", СообщениеОтправлено()));
	КонецЕсли;

	Токен = НовыйТокен();
	Объект.ТокенПодтвержденияХеш = ХешТокена(Токен);
	Объект.ПодтверждениеДействуетДо = ТекДата + 86400;
	Объект.ПодтверждениеВыслано = ТекДата;
	Объект.Записать();

	Если НЕ ОтправитьПисьмоСоСсылкой(Объект.Адресат, Объект.Наименование, Токен) Тогда
		Возврат Ошибка(500, "Не удалось отправить письмо. Обратитесь в поддержку.");
	КонецЕсли;

	Возврат Ответ(200, Новый Структура("message", СообщениеОтправлено()));

КонецФункции

// Завершает регистрацию: по токену из письма подтверждает почту и задает пароль.
//
// Параметры:
//  Токен - Строка - токен из ссылки в письме
//  Пароль - Строка - новый пароль (не короче 8 символов)
//
// Возвращаемое значение:
//  Структура - Код (Число), Данные (Структура: token, name при успехе; message при ошибке)
//
Функция УстановитьПароль(Знач Токен, Знач Пароль) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Если ПустаяСтрока(Токен) Тогда
		Возврат Ошибка(400, "Ссылка недействительна или устарела.");
	КонецЕсли;
	Если СтрДлина(Пароль) < 8 Тогда
		Возврат Ошибка(400, "Пароль должен быть не короче 8 символов.");
	КонецЕсли;
	Если СтрДлина(Пароль) > 100 Тогда
		Возврат Ошибка(400, "Пароль слишком длинный.");
	КонецЕсли;

	Участник = Справочники.expert1cУчастникиПортала.НайтиПоРеквизиту("ТокенПодтвержденияХеш", ХешТокена(Токен));
	Если Участник.Пустая() Тогда
		Возврат Ошибка(400, "Ссылка недействительна или устарела.");
	КонецЕсли;

	Объект = Участник.ПолучитьОбъект();
	Если ТекущаяДатаСеанса() > Объект.ПодтверждениеДействуетДо Тогда
		Возврат Ошибка(400, "Ссылка недействительна или устарела.");
	КонецЕсли;

	Объект.Соль = НовыйТокен();
	Объект.ХешПароля = ХешПароля(Пароль, Объект.Соль);
	Объект.Подтвержден = Истина;
	Объект.ТокенПодтвержденияХеш = "";
	Объект.ПодтверждениеДействуетДо = Дата(1, 1, 1);
	Объект.ПопыткиВхода = 0;
	Объект.БлокировкаДо = Дата(1, 1, 1);

	ТокенСессии = НоваяСессия(Объект);
	Объект.Записать();

	Возврат Ответ(200, Новый Структура("token,name", ТокенСессии, Объект.Наименование));

КонецФункции

// Выполняет вход по почте и паролю.
//
// Параметры:
//  Email - Строка - почта (логин)
//  Пароль - Строка - пароль
//
// Возвращаемое значение:
//  Структура - Код (Число), Данные (Структура: token, name при успехе; message при ошибке)
//
Функция Войти(Знач Email, Знач Пароль) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	ОшибкаВхода = Ошибка(401, "Неверный адрес почты или пароль.");

	Участник = Справочники.expert1cУчастникиПортала.НайтиПоРеквизиту("Email", НормализоватьEmail(Email));
	Если Участник.Пустая() Тогда
		Возврат ОшибкаВхода;
	КонецЕсли;

	Объект = Участник.ПолучитьОбъект();
	Если НЕ Объект.Подтвержден ИЛИ ПустаяСтрока(Объект.ХешПароля) Тогда
		Возврат ОшибкаВхода;
	КонецЕсли;

	ТекДата = ТекущаяДатаСеанса();
	Если Объект.БлокировкаДо > ТекДата Тогда
		Возврат Ошибка(429, "Слишком много неудачных попыток. Повторите вход через 15 минут.");
	КонецЕсли;

	Если Объект.ХешПароля <> ХешПароля(Пароль, Объект.Соль) Тогда
		Объект.ПопыткиВхода = Объект.ПопыткиВхода + 1;
		Если Объект.ПопыткиВхода >= 5 Тогда
			Объект.ПопыткиВхода = 0;
			Объект.БлокировкаДо = ТекДата + 900;
		КонецЕсли;
		Объект.Записать();
		Возврат ОшибкаВхода;
	КонецЕсли;

	Объект.ПопыткиВхода = 0;
	ТокенСессии = НоваяСессия(Объект);
	Объект.Записать();

	Возврат Ответ(200, Новый Структура("token,name", ТокенСессии, Объект.Наименование));

КонецФункции

// Находит участника по токену сессии.
//
// Параметры:
//  Токен - Строка - токен сессии из заголовка запроса
//
// Возвращаемое значение:
//  Структура, Неопределено - Ссылка, Адресат, Контрагент, НазваниеОрганизации, Имя; Неопределено, если токен неверный или просрочен
//
Функция УчастникПоТокену(Знач Токен) Экспорт

	Если ПустаяСтрока(Токен) Тогда
		Возврат Неопределено;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);

	Участник = Справочники.expert1cУчастникиПортала.НайтиПоРеквизиту("ТокенСессииХеш", ХешТокена(Токен));
	Если Участник.Пустая() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если НЕ Участник.Подтвержден ИЛИ ТекущаяДатаСеанса() > Участник.ТокенСессииДействуетДо Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат Новый Структура("Ссылка,Адресат,Контрагент,НазваниеОрганизации,Имя",
		Участник, Участник.Адресат, Участник.Контрагент, Участник.НазваниеОрганизации, Участник.Наименование);

КонецФункции

// Создает заявку от имени участника портала. Заявка попадает в тот же список, что и заявки из писем.
//
// Параметры:
//  Участник - Структура - результат УчастникПоТокену
//  Тема - Строка - тема заявки
//  Текст - Строка - описание
//
// Возвращаемое значение:
//  Структура - Код (Число), Данные (Структура: number при успехе; message при ошибке)
//
Функция СоздатьЗаявку(Участник, Знач Тема, Знач Текст) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Тема = Лев(СокрЛП(Тема), 150);
	Текст = Лев(СокрЛП(Текст), 10000);
	Если ПустаяСтрока(Тема) ИЛИ ПустаяСтрока(Текст) Тогда
		Возврат Ошибка(400, "Заполните тему и описание заявки.");
	КонецЕсли;

	// Защита от флуда: не больше 20 заявок в час от одного участника.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	Задача.ЗаявкаНаВыполнение КАК Заявки
	|ГДЕ
	|	Заявки.АдресацияИнициатор = &Адресат
	|	И Заявки.Дата >= &Граница";
	Запрос.УстановитьПараметр("Адресат", Участник.Адресат);
	Запрос.УстановитьПараметр("Граница", ТекущаяДатаСеанса() - 3600);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.Количество >= 20 Тогда
		Возврат Ошибка(429, "Слишком много заявок за последний час. Повторите позже.");
	КонецЕсли;

	// Контрагент мог не найтись при регистрации (например, его завели позже) - пробуем еще раз.
	Контрагент = Участник.Контрагент;
	Варианты = Новый Массив;
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Подбор = ПодобратьКонтрагента(Участник.НазваниеОрганизации);
		Контрагент = Подбор.Контрагент;
		Варианты = Подбор.Варианты;
		Если ЗначениеЗаполнено(Контрагент) Тогда
			// Заявки участника без контрагента заполнятся при записи (см. модуль объекта справочника).
			Объект = Участник.Ссылка.ПолучитьОбъект();
			Объект.Контрагент = Контрагент;
			Объект.Записать();
		КонецЕсли;
	КонецЕсли;

	Заявка = Задачи.ЗаявкаНаВыполнение.СоздатьЗадачу();
	Заявка.Дата = ТекущаяДатаСеанса();
	Заявка.Тема = Тема;
	Заявка.Наименование = Лев(Тема, 25);
	Заявка.Содержание = Текст;
	Заявка.АдресацияИсполнитель = Константы.ИсполнительЗадачиПоУмолчанию.Получить();
	Заявка.Статус = Справочники.СтатусЗадачНаВыполнение.Принята;
	Заявка.АдресацияИнициатор = Участник.Адресат;
	Заявка.АдресацияКонтрагент = Контрагент;

	Получатель = Заявка.Получатели.Добавить();
	Получатель.Адресат = Участник.Адресат;
	Получатель.Оповещать = Истина;

	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Комментарий = Заявка.ВнутренниеКоментарии.Добавить();
		Комментарий.Комментарий = КомментарийОНеопределенномКонтрагенте(Участник.НазваниеОрганизации, Варианты);
	КонецЕсли;

	Заявка.Записать();

	Возврат Ответ(200, Новый Структура("number", Заявка.Номер));

КонецФункции

// Возвращает заявки участника (последние 200).
//
// Параметры:
//  Участник - Структура - результат УчастникПоТокену
//
// Возвращаемое значение:
//  Структура - Код (Число), Данные (Структура: requests - Массив структур number, date, subject, status, done)
//
Функция СписокЗаявок(Участник) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 200
	|	Заявки.Номер КАК Номер,
	|	Заявки.Дата КАК Дата,
	|	Заявки.Тема КАК Тема,
	|	Статусы.Наименование КАК Статус,
	|	Заявки.Выполнена КАК Выполнена
	|ИЗ
	|	Задача.ЗаявкаНаВыполнение КАК Заявки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтатусЗадачНаВыполнение КАК Статусы
	|		ПО Заявки.Статус = Статусы.Ссылка
	|ГДЕ
	|	Заявки.АдресацияИнициатор = &Адресат
	|	И НЕ Заявки.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Заявки.Дата УБЫВ";
	Запрос.УстановитьПараметр("Адресат", Участник.Адресат);
	Выборка = Запрос.Выполнить().Выбрать();

	Список = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Список.Добавить(Новый Структура("number,date,subject,status,done",
			Выборка.Номер, ПредставлениеДаты(Выборка.Дата), Выборка.Тема,
			СтатусДляПортала(Выборка.Статус, Выборка.Выполнена), Выборка.Выполнена));
	КонецЦикла;

	Возврат Ответ(200, Новый Структура("requests", Список));

КонецФункции

// Возвращает одну заявку участника с перепиской.
//
// Параметры:
//  Участник - Структура - результат УчастникПоТокену
//  Номер - Строка - номер заявки
//
// Возвращаемое значение:
//  Структура - Код (Число), Данные (Структура: number, date, subject, text, status, done, messages)
//
Функция ПолучитьЗаявку(Участник, Знач Номер) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Номер = Прав("000000000" + СокрЛП(Номер), 9);
	Ссылка = Задачи.ЗаявкаНаВыполнение.НайтиПоНомеру(Номер);
	// Чужая и несуществующая заявки неразличимы для вызывающего.
	Если Ссылка.Пустая() Тогда
		Возврат Ошибка(404, "Заявка не найдена.");
	КонецЕсли;
	Заявка = Ссылка.ПолучитьОбъект();
	Если Заявка.ПометкаУдаления ИЛИ Заявка.АдресацияИнициатор <> Участник.Адресат Тогда
		Возврат Ошибка(404, "Заявка не найдена.");
	КонецЕсли;

	ТекстЗаявки = СокрЛП(Заявка.Содержание);

	// Только письма: внутренние комментарии исполнителей (ВнутренниеКоментарии) участнику не показываются.
	Сообщения = Новый Массив;
	КоличествоПисем = Заявка.Письма.Количество();
	Для Индекс = Макс(0, КоличествоПисем - 50) По КоличествоПисем - 1 Цикл
		Письмо = Заявка.Письма[Индекс].Письмо;
		Если Письмо.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		Исходящее = ТипЗнч(Письмо) = Тип("ДокументСсылка.ИсходящееПисьмо");
		Если Исходящее Тогда
			Текст = ТекстИзХранилища(Письмо.ТекстХранилище);
		Иначе
			Текст = ТекстИзХранилища(Письмо.ТекстПисьмаПростойТекстХранилище);
		КонецЕсли;
		Текст = СокрЛП(Текст);
		// Первое письмо заявки, созданной из почты, совпадает с описанием.
		Если НЕ Исходящее И Текст = ТекстЗаявки Тогда
			Продолжить;
		КонецЕсли;
		Сообщения.Добавить(Новый Структура("outgoing,date,text", Исходящее, ПредставлениеДаты(Письмо.Дата), Лев(Текст, 5000)));
	КонецЦикла;

	Данные = Новый Структура;
	Данные.Вставить("number", Заявка.Номер);
	Данные.Вставить("date", ПредставлениеДаты(Заявка.Дата));
	Данные.Вставить("subject", Заявка.Тема);
	Данные.Вставить("text", ТекстЗаявки);
	Данные.Вставить("status", СтатусДляПортала(Заявка.Статус.Наименование, Заявка.Выполнена));
	Данные.Вставить("done", Заявка.Выполнена);
	Данные.Вставить("messages", Сообщения);

	Возврат Ответ(200, Данные);

КонецФункции

// Заполняет контрагента в заявках участника, у которых он еще не указан.
// Вызывается при записи справочника участников, когда контрагент определен (автоматически или вручную).
//
// Параметры:
//  Адресат - СправочникСсылка.АдресатыПочтовыхСообщений - инициатор заявок
//  Контрагент - СправочникСсылка.Контрагенты - контрагент участника
//
Процедура ПривязатьЗаявкиКонтрагента(Адресат, Контрагент) Экспорт

	Если НЕ ЗначениеЗаполнено(Адресат) ИЛИ НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Заявки.Ссылка КАК Ссылка
	|ИЗ
	|	Задача.ЗаявкаНаВыполнение КАК Заявки
	|ГДЕ
	|	Заявки.АдресацияИнициатор = &Адресат
	|	И Заявки.АдресацияКонтрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	И НЕ Заявки.ПометкаУдаления";
	Запрос.УстановитьПараметр("Адресат", Адресат);
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		Попытка
			Заявка = Выборка.Ссылка.ПолучитьОбъект();
			Заявка.АдресацияКонтрагент = Контрагент;
			Заявка.Записать();
		Исключение
			ЗаписьЖурналаРегистрации("Портал заявок", УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Задачи.ЗаявкаНаВыполнение, Выборка.Ссылка, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

// Формирует результат с ошибкой.
//
// Параметры:
//  Код - Число - код ответа HTTP
//  Сообщение - Строка - текст для пользователя
//
// Возвращаемое значение:
//  Структура - Код (Число), Данные (Структура: message)
//
Функция Ошибка(Код, Сообщение) Экспорт

	Возврат Ответ(Код, Новый Структура("message", Сообщение));

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Ответ(Код, Данные)

	Возврат Новый Структура("Код,Данные", Код, Данные);

КонецФункции

Функция СообщениеОтправлено()

	Возврат "Если адрес указан верно, на него отправлено письмо со ссылкой. Ссылка действует 24 часа.";

КонецФункции

Функция НормализоватьEmail(Email)

	Возврат НРег(СокрЛП(Email));

КонецФункции

Функция EmailКорректен(Email)

	Если ПустаяСтрока(Email) ИЛИ СтрДлина(Email) > 100 ИЛИ СтрНайти(Email, " ") > 0 Тогда
		Возврат Ложь;
	КонецЕсли;

	Части = СтрРазделить(Email, "@", Ложь);
	Если Части.Количество() <> 2 Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат СтрНайти(Части[1], ".") > 1 И Прав(Части[1], 1) <> ".";

КонецФункции

Функция НовыйТокен()

	Возврат СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "")
		+ СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "");

КонецФункции

Функция ХешТокена(Токен)

	Хеш = Новый ХешированиеДанных(ХешФункция.SHA256);
	Хеш.Добавить(Токен);
	Возврат СтрЗаменить(Строка(Хеш.ХешСумма), " ", "");

КонецФункции

Функция ХешПароля(Пароль, Соль)

	Хеш = Новый ХешированиеДанных(ХешФункция.SHA256);
	Хеш.Добавить(Соль + Пароль);
	Результат = Хеш.ХешСумма;

	Для Счетчик = 1 По 3000 Цикл
		Хеш = Новый ХешированиеДанных(ХешФункция.SHA256);
		Хеш.Добавить(Результат);
		Хеш.Добавить(Соль);
		Результат = Хеш.ХешСумма;
	КонецЦикла;

	Возврат СтрЗаменить(Строка(Результат), " ", "");

КонецФункции

Функция НоваяСессия(Объект)

	Токен = НовыйТокен();
	Объект.ТокенСессииХеш = ХешТокена(Токен);
	Объект.ТокенСессииДействуетДо = ТекущаяДатаСеанса() + 43200;
	Возврат Токен;

КонецФункции

// Ищет контрагента по названию организации, которое указал пользователь.
// Подставляется только единственный контрагент с совпадающим названием (без учета регистра, кавычек
// и организационно-правовой формы). Похожие названия возвращаются как варианты для ручного выбора сотрудником.
Функция ПодобратьКонтрагента(Знач НазваниеОрганизации)

	Результат = Новый Структура("Контрагент,Варианты", Справочники.Контрагенты.ПустаяСсылка(), Новый Массив);

	Искомое = НормализованноеНазвание(НазваниеОрганизации);
	Если СтрДлина(Искомое) < 3 Тогда
		Возврат Результат;
	КонецЕсли;

	// Кандидаты: название содержит искомое целиком или самое длинное слово искомого.
	НаибольшееСлово = СамоеДлинноеСлово(Искомое);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 100
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты.Наименование КАК Наименование,
	|	ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(300)) КАК НаименованиеПолное,
	|	Контрагенты.ИНН КАК ИНН
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	НЕ Контрагенты.ЭтоГруппа
	|	И НЕ Контрагенты.ПометкаУдаления
	|	И (Контрагенты.Наименование ПОДОБНО &ШаблонЦеликом СПЕЦСИМВОЛ ""~""
	|		ИЛИ ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(300)) ПОДОБНО &ШаблонЦеликом СПЕЦСИМВОЛ ""~""
	|		ИЛИ Контрагенты.Наименование ПОДОБНО &ШаблонСлова СПЕЦСИМВОЛ ""~""
	|		ИЛИ ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(300)) ПОДОБНО &ШаблонСлова СПЕЦСИМВОЛ ""~"")
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагенты.Наименование";
	Запрос.УстановитьПараметр("ШаблонЦеликом", "%" + ЭкранироватьДляПодобно(Искомое) + "%");
	Запрос.УстановитьПараметр("ШаблонСлова", "%" + ЭкранироватьДляПодобно(НаибольшееСлово) + "%");
	Выборка = Запрос.Выполнить().Выбрать();

	Точные = Новый Массив;
	Остальные = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Представление = Выборка.Наименование + ?(ПустаяСтрока(Выборка.ИНН), "", " (ИНН " + Выборка.ИНН + ")");
		Кандидат = Новый Структура("Ссылка,Представление", Выборка.Ссылка, Представление);
		Если НормализованноеНазвание(Выборка.Наименование) = Искомое
			ИЛИ НормализованноеНазвание(Выборка.НаименованиеПолное) = Искомое Тогда
			Точные.Добавить(Кандидат);
		Иначе
			Остальные.Добавить(Кандидат);
		КонецЕсли;
	КонецЦикла;

	Если Точные.Количество() = 1 Тогда
		Результат.Контрагент = Точные[0].Ссылка;
		Возврат Результат;
	КонецЕсли;

	// Неоднозначно или не найдено: сотрудник выберет вручную, сначала показываем точные совпадения.
	Для Каждого Вариант Из Точные Цикл
		Результат.Варианты.Добавить(Вариант.Представление);
	КонецЦикла;
	Для Каждого Вариант Из Остальные Цикл
		Если Результат.Варианты.Количество() >= 5 Тогда
			Прервать;
		КонецЕсли;
		Результат.Варианты.Добавить(Вариант.Представление);
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция СамоеДлинноеСлово(Текст)

	Результат = "";
	Для Каждого Слово Из СтрРазделить(Текст, " ", Ложь) Цикл
		Если СтрДлина(Слово) > СтрДлина(Результат) Тогда
			Результат = Слово;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;

КонецФункции

// Приводит название организации к виду для сравнения: без регистра, кавычек, знаков препинания и
// организационно-правовой формы (ООО, АО, ИП и т.п.), "ё" заменяется на "е".
Функция НормализованноеНазвание(Название)

	Текст = " " + НРег(СокрЛП(Название)) + " ";
	Текст = СтрЗаменить(Текст, "ё", "е");

	Для Каждого Символ Из СтрРазделить("«|»|""|'|`|„|“|”|(|)|,|;|.", "|") Цикл
		Текст = СтрЗаменить(Текст, Символ, " ");
	КонецЦикла;

	Формы = СтрРазделить(
		"общество с ограниченной ответственностью|закрытое акционерное общество|открытое акционерное общество|"
		+ "публичное акционерное общество|непубличное акционерное общество|акционерное общество|"
		+ "индивидуальный предприниматель|ооо|зао|оао|пао|нао|ао|ип|чп|тоо",
		"|");
	Для Каждого Форма Из Формы Цикл
		// Дважды: соседние формы разделены одним пробелом, и первая замена съедает его.
		Текст = СтрЗаменить(Текст, " " + Форма + " ", " ");
		Текст = СтрЗаменить(Текст, " " + Форма + " ", " ");
	КонецЦикла;

	Возврат СтрСоединить(СтрРазделить(Текст, " ", Ложь), " ");

КонецФункции

Функция ЭкранироватьДляПодобно(Текст)

	Для Каждого Символ Из СтрРазделить("~|%|_|[|]", "|") Цикл
		Текст = СтрЗаменить(Текст, Символ, "~" + Символ);
	КонецЦикла;
	Возврат Текст;

КонецФункции

Функция КомментарийОНеопределенномКонтрагенте(НазваниеОрганизации, Варианты)

	Текст = "Портал заявок: контрагент не определен автоматически." + Символы.ПС
		+ "Организация, указанная пользователем при регистрации: " + НазваниеОрганизации + "." + Символы.ПС;
	Если Варианты.Количество() > 0 Тогда
		Текст = Текст + "Возможные совпадения: " + СтрСоединить(Варианты, "; ") + "." + Символы.ПС;
	Иначе
		Текст = Текст + "Похожих контрагентов не найдено." + Символы.ПС;
	КонецЕсли;
	Возврат Текст + "Выберите контрагента в карточке участника портала (справочник ""Участники портала заявок""): "
		+ "контрагент подставится во все заявки участника.";

КонецФункции

Функция ОтправитьПисьмоСоСсылкой(Адресат, Имя, Токен)

	Попытка
		АдресПортала = СокрЛП(Константы.expert1cАдресПортала.Получить());
		Если ПустаяСтрока(АдресПортала) Тогда
			ЗаписьЖурналаРегистрации("Портал заявок", УровеньЖурналаРегистрации.Ошибка, , ,
				"Не заполнена константа ""Адрес портала заявок"".");
			Возврат Ложь;
		КонецЕсли;
		Если Прав(АдресПортала, 1) <> "/" Тогда
			АдресПортала = АдресПортала + "/";
		КонецЕсли;

		ТекДата = ТекущаяДатаСеанса();
		Письмо = Документы.ИсходящееПисьмо.СоздатьДокумент();
		Получатель = Письмо.ПолучателиПисьма.Добавить();
		Получатель.Адресат = Адресат;
		Письмо.Дата = ТекДата;
		Письмо.Тема = "Подтверждение почты на портале заявок";
		Письмо.ТекстХранилище = Новый ХранилищеЗначения(
			"Здравствуйте, " + Имя + "!" + Символы.ПС + Символы.ПС
			+ "Чтобы подтвердить почту и задать пароль на портале заявок, перейдите по ссылке:" + Символы.ПС
			+ АдресПортала + "?token=" + Токен + Символы.ПС + Символы.ПС
			+ "Ссылка действует 24 часа. Если вы не запрашивали регистрацию или смену пароля, просто проигнорируйте это письмо.");
		Письмо.УчетнаяЗапись = Константы.УчетнаяЗаписьПоддержки.Получить();
		Письмо.ПодготовленоКОтправке = ТекДата;
		Письмо.Записать();
		Возврат Истина;
	Исключение
		ЗаписьЖурналаРегистрации("Портал заявок", УровеньЖурналаРегистрации.Ошибка, , ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Ложь;
	КонецПопытки;

КонецФункции

Функция ТекстИзХранилища(Хранилище)

	Если ТипЗнч(Хранилище) <> Тип("ХранилищеЗначения") Тогда
		Возврат "";
	КонецЕсли;

	Значение = Хранилище.Получить();
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		Возврат Значение;
	ИначеЕсли ТипЗнч(Значение) = Тип("ФорматированныйДокумент") Тогда
		Возврат Значение.ПолучитьТекст();
	КонецЕсли;

	Возврат "";

КонецФункции

Функция ПредставлениеДаты(ЗначениеДаты)

	Возврат Формат(ЗначениеДаты, "ДФ='dd.MM.yyyy HH:mm'");

КонецФункции

Функция СтатусДляПортала(Статус, Выполнена)

	Возврат ?(Выполнена, "Выполнена", Строка(Статус));

КонецФункции

#КонецОбласти
